# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Modular IRC client
brew "irssi"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal-based visual file manager
brew "midnight-commander"
# Cross platform, open source .NET development framework
brew "mono"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Office suite
cask "microsoft-office"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
vscode "1c-syntax.language-1c-bsl"
vscode "arjun.swagger-viewer"
vscode "aykutsarac.jsoncrack-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "d-koppenhagen.vscode-code-review"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "evilbeaver.oscript-debug"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "jebbs.plantuml"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "yzane.markdown-pdf"
